DROP PROCEDURE IF EXISTS add_migration;
delimiter ??
CREATE PROCEDURE `add_migration`()
BEGIN
DECLARE v INT DEFAULT 1;
SET v = (SELECT COUNT(*) FROM `migrations` WHERE `id`='20191112183837');
IF v=0 THEN
INSERT INTO `migrations` VALUES ('20191112183837');
-- Add your query below.


UPDATE `quest_greeting` SET `content_loc8` = "Приветствую, $gгражданин:гражданка;. Ты не выглядишь $gпраздным:праздной; зевакой. Что за дело привело тебя в армию Штормграда?" WHERE `entry` = 261;
UPDATE `quest_greeting` SET `content_loc8` = "Скверна проникла в Западный Край. Пока я сражался в боях за Лордерон, эти прекрасные фермы превратились в заброшенные руины, и в них поселились головорезы и убийцы. Народному ополчению нужна твоя помощь." WHERE `entry` = 234;
UPDATE `quest_greeting` SET `content_loc8` = "В Степях встречается множество различных ингридиентов, которые представляют интерес для нас, фармацевтов Лордаэрона." WHERE `entry` = 3390;
UPDATE `quest_greeting` SET `content_loc8` = "$c, а? Я Кразек, секретарь барона Ревилгаза. Я знаю все, что происходит в этих джунглях и за их пределами. Возможно, тебе будет интересно узнать цену на нефть в Кабестане? Нет? Может быть, ты ищешь работу? Я могу помочь тебе здесь." WHERE `entry` = 773;
UPDATE `quest_greeting` SET `content_loc8` = "А вот и ты! У меня есть для тебя несколько задач, но нет времени на их разъяснение. Так что слушай внимательно." WHERE `entry` = 1499;
UPDATE `quest_greeting` SET `content_loc8` = "Порча пробирается в рощу природы. Лес должен быть защищен любой ценой." WHERE `entry` = 2930;
UPDATE `quest_greeting` SET `content_loc8` = "Проклятая лига пивоваров! У них есть все лучшие ингредиенты, в то время как мы застряли здесь с зерном и шишками хмеля!" WHERE `entry` = 1374;
UPDATE `quest_greeting` SET `content_loc8` = "Темные силы посягают на наши границы, возрождается древняя зараза, появляется новое зло желающее разрушить тонкий баланс земли. В эти темные времена мы все должны быть бдительны." WHERE `entry` = 3649;
UPDATE `quest_greeting` SET `content_loc8` = "Не позволяй жаре беспокоить себя. В Бесплодных землях она наименьшая из проблем." WHERE `entry` = 5394;
UPDATE `quest_greeting` SET `content_loc8` = "Чтобы выжили наши люди, мы должны изучить пути природы и познать ее секреты." WHERE `entry` = 3419;
UPDATE `quest_greeting` SET `content_loc8` = "Приветствую, $c! Прекрасный день для охоты, не правда ли? У меня не большие проблемы с кабанами. Не желаешь поохотиться?" WHERE `entry` = 714;
UPDATE `quest_greeting` SET `content_loc8` = "Приветствую тебя, $c. Если ты направишься в Бастион, то будь $gосторожен:осторожна;. Недавние отчеты разведки указывают на увеличение активности Плети в этом районе." WHERE `entry` = 1495;
UPDATE `quest_greeting` SET `content_loc8` = "Привет. Я Грелин Белобород. Здесь я изучаю угрозу, исходящую от растущего числа троллей в Холодной долине. Что я нашел? Это и беспокоит..." WHERE `entry` = 786;
UPDATE `quest_greeting` SET `content_loc8` = "Приветствую тебя, $c. Обычно я присматриваю за народом Штормграда, но в это тяжелое время, многие наши стражники ушли на сражения в другие края. И вот теперь, вместо того чтобы вести патруль, я как заместитель, предлагаю вознаграждение за оказанную помощь..." WHERE `entry` = 823;
UPDATE `quest_greeting` SET `content_loc8` = "Привет! Духи говорят что ты $gпришел:пришла; чтобы оказать помощь." WHERE `entry` = 2519;
UPDATE `quest_greeting` SET `content_loc8` = "Привет, $n. У тебя не найдется времени поговорить?" WHERE `entry` = 7900;
UPDATE `quest_greeting` SET `content_loc8` = "Послушай $gприятель:приятельница;. Меня зовут Реми.$BЯ с востока Красногорья, а сюда пришел за делом, да, за делом. У тебя не найдется дела? Не найдется?" WHERE `entry` = 241;
UPDATE `quest_greeting` SET `content_loc8` = "Как хорошо, что ты здесь, $c.$B$BМеня зовут Лотвиль Вериатус и я состою в Просвещенной Ассамблее Чародейства, Алхимии и Технических Наук. Мы стремимся объединить интеллектуальные науки Азерота в одну общеобразовательную школу." WHERE `entry` = 2921;
UPDATE `quest_greeting` SET `content_loc8` = "Учитывая все обстоятельства, надеюсь, ты хорошо себя чувствуешь.$B$BПрисаживайся и выслушай мой рассказ, трагедию, которая я надеюсь закончиться местью!" WHERE `entry` = 1500;
UPDATE `quest_greeting` SET `content_loc8` = "Приветствую тебя, $n." WHERE `entry` = 5887;
UPDATE `quest_greeting` SET `content_loc8` = "Если я заполучу все необходимые ингредиенты, я смогу создать взрывчатку, которая не только нанесет урон Торговой Компании, но еще и отвлечет ее.$B$BЯ знаю что тебя это впечатлило, но еще лучше... обо всем остальном я расскажу тебе позже." WHERE `entry` = 4077;
UPDATE `quest_greeting` SET `content_loc8` = "Если мы хотим занять свое место в этом мире, мы должны заниматься исследованиями, а также игнорировать наши угасающие человеческие инстинкты." WHERE `entry` = 5204;
UPDATE `quest_greeting` SET `content_loc8` = "Информация... Благодаря нашим разведчикам и агентам мы контролируем поток информации в Лордероне. Передвижение Плети, их запасы, все под нашим бдительным оком..." WHERE `entry` = 2121;
UPDATE `quest_greeting` SET `content_loc8` = "Моя семья может похвастаться лучшей коллекцией ювелирных изделий и предметами искусства среди всех дворян Штормграда!$B$BИ мы всегда жаждем расширить свою коллекцию..." WHERE `entry` = 2285;
UPDATE `quest_greeting` SET `content_loc8` = "В этих краях нет ничего кроме неприятностей. Я пытался сказать этому глупцу Сальдену чтобы он уходил пока может, но он не хотел и слышать об этом. Но я не глупец, как только мы с Верной починим эту повозку, сразу уедем отсюда." WHERE `entry` = 237;
UPDATE `quest_greeting` SET `content_loc8` = "Некоторые задаются вопросом, чем мы занимаемся здесь, в пустыне. Что ж... если я расскажу тебе, тогда ты останешься здесь и попытаешься получить от этого нашу прибыль!" WHERE `entry` = 7876;
UPDATE `quest_greeting` SET `content_loc8` = "Я чем-то могу помочь тебе, $n? А то меня ждет партия товара." WHERE `entry` = 3453;
UPDATE `quest_greeting` SET `content_loc8` = "Иногда мне кажется, что в небе есть огромное серое облако, которое льет на нас дождем невезенья. Сперва у нас отобрали нашу землю, а теперь мы даже не можем выбраться из Западного Края. Все это неправильно и с этим нужно что-то делать." WHERE `entry` = 238;
UPDATE `quest_greeting` SET `content_loc8` = "Темная Госпожа поставила нам задачу, и мы должны решить ее." WHERE `entry` = 1518;
UPDATE `quest_greeting` SET `content_loc8` = "Темная Госпожа поручила Королевскому фармацевтическому обществу разработать новую чуму. Мы поставим Артаса и его мерзкую армию на колени." WHERE `entry` = 1937;
UPDATE `quest_greeting` SET `content_loc8` = "Земля, вода и небо едины. Разделение существует только в твоих глазах. Мать-Земля заключает в себя все, и даже более этого." WHERE `entry` = 3338;
UPDATE `quest_greeting` SET `content_loc8` = "Меня зовут Чепухастер и я главный инженер компании \"Воды Прибамбасска\". Чем я могу помочь тебе?" WHERE `entry` = 7407;
UPDATE `quest_greeting` SET `content_loc8` = "Алый орден вторгся в наши земли. Эти глупые фанатики еще не понимают, что верные слуги Темной Госпожи увидят их кончину." WHERE `entry` = 1515;
UPDATE `quest_greeting` SET `content_loc8` = "Ветер шепчет тем, кто слушает...$B$BТы слышишь его?" WHERE `entry` = 3616;
UPDATE `quest_greeting` SET `content_loc8` = "Есть кое-что, что нужно обсудить, $c... проходи, присаживайся." WHERE `entry` = 3188;
UPDATE `quest_greeting` SET `content_loc8` = "Котел бурлит большими зелеными пузырями. Черепа, кости, органы неизвестных существ плавают внутри этого вязкого бульона...$B$BНа поверхность лениво всплывают черепа двух некогда могучих троллей, Ган'зулаха и Неззилока." WHERE `entry` = 2076;
UPDATE `quest_greeting` SET `content_loc8` = "Этот свинарник не очень-то удобен, но у него есть своя история, и для кого-то Каменор, наверное, важен. Мне еще повезло, что мы тут застряли. Конечно, не из-за его красот, - это место трудно назвать даже подобием дома." WHERE `entry` = 5591;
UPDATE `quest_greeting` SET `content_loc8` = "Тралл заплатил мне и моим ребятам за помощь в строительстве Оргриммара, так что я решил основать здесь порт. В основном мы обделываем делишки в Пиратской Бухте, через барона Ревилгаза." WHERE `entry` = 3391;
UPDATE `quest_greeting` SET `content_loc8` = "Тром'ка, $c! Так мало времени для разговоров и так много работы предстоит сделать." WHERE `entry` = 3139;
UPDATE `quest_greeting` SET `content_loc8` = "У нас эльфов большая история. Будем надеяться, что она никогда не повторится, и не будет преследовать нас." WHERE `entry` = 3845;
UPDATE `quest_greeting` SET `content_loc8` = "Может мы и не в открытой войне с Альянсом, но между нами все еще льется кровь." WHERE `entry` = 4791;
UPDATE `quest_greeting` SET `content_loc8` = "Мы здесь ради прибыли, а украденные товары этому не способствуют." WHERE `entry` = 7882;
UPDATE `quest_greeting` SET `content_loc8` = "Добро пожаловать в наш скромный обитель! Всегда приятно видеть дружелюбное лицо. Какое у тебя крепкое оружие, а нам с мужем всегда нужна помощь в округе нашей фермы, ведь теперь, когда большинство людей ушло, сложно найти кого-то, кто способен помочь." WHERE `entry` = 235;
UPDATE `quest_greeting` SET `content_loc8` = "Ну, привет. Судя по твоим глазам, ты не откажешься от лишних звенящих монет, а? Я Могул Кебок, контролирую все операции в Азероте, и если ты ищешь богатства, возможно, мы сможем договориться." WHERE `entry` = 737;
UPDATE `quest_greeting` SET `content_loc8` = "Ну, кто это, как не $c, что рвется на поле брани со всем юным пылом? Несомненно, тебя привлекли сюда слухи о моих подвигах.$B$BСейчас не время для замшелых историй, но время для великих и доблестных свершений! Если ты ищешь славы, то сегодня удача улыбнулась тебе." WHERE `entry` = 1343;
UPDATE `quest_greeting` SET `content_loc8` = "Что-что?! Мы все получаем прибыль, занимаясь... и останься мы без дела, у нас ничего этого не будет." WHERE `entry` = 2498;
UPDATE `quest_greeting` SET `content_loc8` = "Да, да, да! Именно тебя мне и нужно, $r!$B$BПрисаживайся! Нам нужно многое обсудить!" WHERE `entry` = 3446;
UPDATE `quest_greeting` SET `content_loc8` = "Ты не однократно будешь проходить испытания во тьме, окружающей наши земли, $n. Но чтобы ты всегда $gбыл:была; наготове и сила твоя не ослабла, мы будем часто поручать тебе задания.$B$BСтупай со Светом и оставайся $gдобродетельным:добродетельной;." WHERE `entry` = 6171;


-- End of migration.
END IF;
END??
delimiter ; 
CALL add_migration();
DROP PROCEDURE IF EXISTS add_migration;
